{"developerlogs":["12\/4\/2019: Added support for legacy whitelist keys to migrate over. On clicking the standard legacy purchase link 'paypalautobuy.php' they will be redirected to the login page and automatically upgraded after registration\/login."],"announcements":["4\/10\/2020: We are proud to introduce our new referral system! Get a portion of ROBUX every time somebody purchases SirHurt using your referral link!","1\/14\/2020: We've made a merch store for anyone who would love to show support for SirHurt by purchasing clothing! You can find our selection of items here: https:\/\/teespring.com\/stores\/sirhurt-store","12\/22\/2019: SirHurt V4's database was rolled back to a save from december 5th. Accounts created afterwords need to be re-created. Your serial keys are reactivated and can be used again as if they were never redeemed. Register a new account, you can use your previous login information, then just redeem the key you purchased again. Accounts created before or on December 5th will remain unphased excluding any whitelist updates or password resets made after the 5th.","12\/4\/2019: SirHurt V4 has been released. You can navigate to downloads to download the newest product version. On first use it will prompt you asking for your sirhurt username & password.","12\/4\/2019: ATTENTION NEWCOMERS! SirHurt V4 will be released today after the ROBLOX update comes. If you just barely purchased, you will have to wait until SirHurt V4 releases today to use our products as this login system is new and we are propagating over to it with our new product release. SirHurt V3 does not currently support this form of login. Expect new product release within 24 hours. A new announcement will be made when it's pushed out. Stay posted, and always, thanks you for your patience! -IcePools"],"updatelog":[{"title":"SirHurt V4 - 04\/21\/2021","updates":["Updated for the latest ROBLOX version (version-b69117cbf3b945ef)"]},{"title":"SirHurt V4 - 04\/15\/2021","updates":["Updated for the latest ROBLOX version (version-6d2a459f72544bbf)"]},{"title":"SirHurt V4 - 04\/13\/2021","updates":["Updated for the latest ROBLOX version (version-f261f9133b14457b)"]},{"title":"SirHurt V4 - 04\/08\/2021","updates":["Updated for the latest ROBLOX version (version-278f0258a7224831)"]},{"title":"SirHurt V4 - 03\/30\/2021","updates":["Updated for the latest ROBLOX version (version-0137f7d4848f436a)"]},{"title":"SirHurt V4 - 03\/25\/2021","updates":["Updated for the latest ROBLOX version (version-c1dce7d72f314eb2)"]},{"title":"SirHurt V4 - 03\/24\/2021","updates":["Updated for the latest ROBLOX version (version-c98d7922bb3d4719)"]},{"title":"SirHurt V4 - 03\/17\/2021","updates":["Updated for the latest ROBLOX version (version-c52bceabee8f40e5)"]},{"title":"SirHurt V4 - 03\/09\/2021","updates":["Updated for the latest ROBLOX version (version-5c383cf6549b4c50)"]},{"title":"SirHurt V4 - 03\/03\/2021","updates":["Updated for the latest ROBLOX version (version-aebd6e2ceef04a6c)"]},{"title":"SirHurt V4 - 02\/24\/2021","updates":["Updated for the latest ROBLOX version (version-23850bffd15b4a88)"]},{"title":"SirHurt V4 - 02\/19\/2021","updates":["Updated for the latest ROBLOX version (version-edc343d724ee40c3)"]},{"title":"SirHurt V4 - 02\/17\/2021","updates":["Updated for the latest ROBLOX version (version-a8efc1c638b54108)"]},{"title":"SirHurt V4 - 02\/10\/2021","updates":["Updated for the latest ROBLOX version (version-c26bf9281ab64731)"]},{"title":"SirHurt V4 - 02\/03\/2021","updates":["Updated for the latest ROBLOX version (version-29d2a7fa87dd447b)"]},{"title":"SirHurt V4 - 01\/27\/2021","updates":["Updated for the latest ROBLOX version (version-5a54208fe8e24e87)"]},{"title":"SirHurt V4 - 01\/20\/2021","updates":["Updated for the latest ROBLOX version (version-9472c087fadb4d62)"]},{"title":"SirHurt V4 - 01\/13\/2021","updates":["Updated for the latest ROBLOX version (version-d5212926da8e4716)"]},{"title":"SirHurt V4 - 01\/06\/2021","updates":["Updated for the latest ROBLOX version (version-c180747f2f824fb6)"]},{"title":"SirHurt V4 - 12\/11\/2020","updates":["Updated for the latest ROBLOX version (version-7b3e1cf091a4470b)"]},{"title":"SirHurt V4 - 12\/03\/2020","updates":["Updated for the latest ROBLOX version (version-49e05c4106b541bf)"]},{"title":"SirHurt V4 - 11\/18\/2020","updates":["Updated for the latest ROBLOX version (version-5a2a97e1d9794df1)"]},{"title":"SirHurt V4 - 11\/12\/2020","updates":["Updated for the latest ROBLOX version (version-aa7766fcc7cb4906)"]},{"title":"SirHurt V4 - 11\/11\/2020","updates":["Updated for the latest ROBLOX version (version-316963e1a7c04db4)"]},{"title":"SirHurt V4 - 11\/05\/2020","updates":["Updated for the latest ROBLOX version (version-fd0181e00b9d43f1)"]},{"title":"SirHurt V4 - 10\/28\/2020","updates":["Updated for the latest ROBLOX version (version-9fd711f446e54984)"]},{"title":"SirHurt V4 - 10\/15\/2020","updates":["Updated for the latest ROBLOX version (version-d25d44458f014535)"]},{"title":"SirHurt V4 - 10\/07\/2020","updates":["Updated for the latest ROBLOX version (version-aa66315930d14906)"]},{"title":"SirHurt V4 - 09\/30\/2020","updates":["Updated for the latest ROBLOX version (version-181941c15130443b)"]},{"title":"SirHurt V4 - 09\/24\/2020","updates":["Updated for the latest ROBLOX version (version-b6f5aef0b98348cf)"]},{"title":"SirHurt V4 - 09\/16\/2020","updates":["Updated for the latest ROBLOX version (version-cc7ad37d688d4cd3)"]},{"title":"SirHurt V4 - 09\/10\/2020","updates":["Updated for the latest ROBLOX version (version-aab08b22c58b46f1)"]},{"title":"SirHurt V4 - 08\/27\/2020","updates":["Updated for the latest ROBLOX version (version-0c5386774b0d4ab3)"]},{"title":"SirHurt V4 - 08\/26\/2020","updates":["Updated for the latest ROBLOX version (version-49fb5be7759a4ecf)"]},{"title":"SirHurt V4 - 08\/19\/2020","updates":["Updated for the latest ROBLOX version (version-5306be9929984619)"]},{"title":"SirHurt V4 - 08\/13\/2020","updates":["Updated for the latest ROBLOX version (version-09c7fc016d0f4f4c)"]},{"title":"SirHurt V4 - 08\/07\/2020","updates":["Updated for the latest ROBLOX version ()"]},{"title":"SirHurt V4 - 07\/31\/2020","updates":["Updated for the latest ROBLOX version (version-4e8d93f836b64931)"]},{"title":"SirHurt V4 - 07\/29\/2020","updates":["Updated for the latest ROBLOX version (version-c0b4b6e36f3141a5)"]},{"title":"SirHurt V4 - 07\/22\/2020","updates":["Updated for the latest ROBLOX version (version-93e08958108c4ba7)"]},{"title":"SirHurt V4 - 07\/15\/2020","updates":["Updated for the latest ROBLOX version (version-0f4d8967e7dc4078)"]},{"title":"SirHurt V4 - 07\/08\/2020","updates":["Updated for the latest ROBLOX version (version-46d3c9eff36c4e0c)"]},{"title":"SirHurt V4 - 06\/25\/2020","updates":["Updated for the latest ROBLOX version (version-f44a4c3c254d47db)"]},{"title":"SirHurt V4 - 6\/6\/2020","updates":["Fixed an issue that occured with the game breaking when injecting SirHurt V4."]},{"title":"SirHurt V4 - 3\/25\/2020","updates":["Update for Latest ROBLOX version.","Rewrote the bootstrapper to allow for quicker update distrubtions. Redownloading the bootstrapper is required to continue getting the correct version of SirHurt V4."]},{"title":"SirHurt V4 - 3\/5\/2020","updates":["Added function 'queue_on_teleport'"]},{"title":"SirHurt V4 - 2\/16\/2020","updates":["Modified getgc()","Rewrote getsenv()\/getmenv()","Fixed an issue with setclipboard()"]},{"title":"SirHurt V4 - 2\/7\/2020","updates":["Certain script's protected using ironbrew should no longer cause the game to inf freeze and should now execute properly."]},{"title":"SirHurt V4 - 2\/5\/2020","updates":["ROBLOX Update","Fixed an issue with getconnections() causing a crash when being used on Player.Idled","Fixed an issue where getconstant\/setconstant was causing a false error 'constant level at index (index)' when the index was valid."]},{"title":"SirHurt V4 - 1\/31\/2020","updates":["Added function 'decompile'"]},{"title":"SirHurt V4 - 1\/29\/2020","updates":["Update for latest ROBLOX update.","Fixed an issue with game:HttpPost."]},{"title":"SirHurt V4 - 1\/11\/2020","updates":["Fixed an issue in hookfunction which would crash your game when hooking indexed functions. ex: game.Workspace.FindPartOnRayWithIgnoreList"]},{"title":"SirHurt V4 - 1\/10\/2020","updates":["Edited Drawing Library 'text' property to make font more clear and HD.","Fixed a bug in the authentication code where suspended accounts would never be prompted to enter new login information on re-inject."]},{"title":"SirHurt V4 - 1\/9\/2020","updates":["Fixed an issue with Drawing Library that would cause certain scripts to crash the game"]},{"title":"SirHurt V4 - 1\/9\/2020","updates":["Support for latest ROBLOX Update","Added function Drawing.new()."]},{"title":"SirHurt V4 - 1\/2\/2020","updates":["Fixed issue with isreadonly() not returning a proper result.","Added function is_writeable().","Added function getnilinstances().","Added function is_protected_closure().","Added function hookfunction() (Alias: detour_function).","Added function compare_c_functions()."]},{"title":"SirHurt V4 - 12\/17\/2019","updates":["Update for latest ROBLOX Update","Fixed a bug which should fix large ironbrew scripts x2."]},{"title":"SirHurt V4 - 12\/12\/2019","updates":["Added function 'fireclickdetector'"]},{"title":"SirHurt V4 - 12\/11\/2019","updates":["Slight changes to the internal authentication to potentially fix authentication issues","Update for latest ROBLOX Version"]},{"title":"SirHurt V4 - 12\/9\/2019","updates":["Fixed function 'MouseScroll'","Added function 'Keypress'","Fixed a few bugs."]},{"title":"SirHurt V4 - 12\/8\/2019","updates":["Fixed a problem with the UI not being draggable.","Fixed a few reported script execution issues."]},{"title":"SirHurt V4 - 12\/5\/2019","updates":["Released new SirHurt V4 UI.","Updated bootstrapper to be compatible with the new SirHurt UI. You will be required to redownload the bootstrapper from our offical mega in order to continue using the bootstrapper to update SirHurt & use the new UI."]},{"title":"SirHurt V4 - 12\/4\/2019","updates":["Update for latest ROBLOX Update","Added debug.getinfo \/ debug.getstack\/setstack.","Added luaformat()","First public release of SirHurt V4 BETA. Keep in mind bugs may occur.","Modified teleportation which should fix problems occuring with multiple instance teleportation."]},{"title":"SirHurt V4 - 11\/27\/2019","updates":["Fixed a small handful of bugs with script execution.","Update for latest ROBLOX Update","Improved script runtime.","Patched a bug that was causing some uses to experience problems with using SirHurt V4."]},{"title":"SirHurt V4 - 11\/15\/2019","updates":["Beta Version RELEASED to randomly selected upgraded members and staff."]}]}